Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_fail_safe_bootloader/test_app/firmware/src/packs/PIC32CX2051MTSH128_DFP/component/aesb.h
/* -------- AESB_IDR : (AESB Offset: 0x14) ( /W 32) Interrupt Disable Register -------- */
#define AESB_IDR_DATRDY_Pos                   _UINT32_(0)                                          /* (AESB_IDR) Data Ready Interrupt Disable Position */
#define AESB_IDR_DATRDY_Msk                   (_UINT32_(0x1) << AESB_IDR_DATRDY_Pos)               /* (AESB_IDR) Data Ready Interrupt Disable Mask */
#define AESB_IDR_DATRDY(value)                (AESB_IDR_DATRDY_Msk & (_UINT32_(value) << AESB_IDR_DATRDY_Pos)) /* Assigment of value for DATRDY in the AESB_IDR register */
#define AESB_IDR_URAD_Pos                     _UINT32_(8)                                          /* (AESB_IDR) Unspecified Register Access Detection Interrupt Disable Position */
#define AESB_IDR_URAD_Msk                     (_UINT32_(0x1) << AESB_IDR_URAD_Pos)                 /* (AESB_IDR) Unspecified Register Access Detection Interrupt Disable Mask */
#define AESB_IDR_URAD(value)                  (AESB_IDR_URAD_Msk & (_UINT32_(value) << AESB_IDR_URAD_Pos)) /* Assigment of value for URAD in the AESB_IDR register */
#define AESB_IDR_SECE_Pos                     _UINT32_(19)                                         /* (AESB_IDR) Security and/or Safety Event Position */
#define AESB_IDR_SECE_Msk                     (_UINT32_(0x1) << AESB_IDR_SECE_Pos)                 /* (AESB_IDR) Security and/or Safety Event Mask */
#define AESB_IDR_SECE(value)                  (AESB_IDR_SECE_Msk & (_UINT32_(value) << AESB_IDR_SECE_Pos)) /* Assigment of value for SECE in the AESB_IDR register */
#define AESB_IDR_Msk                          _UINT32_(0x00080101)                                 /* (AESB_IDR) Register Mask  */


/* -------- AESB_IMR : (AESB Offset: 0x18) ( R/ 32) Interrupt Mask Register -------- */
#define AESB_IMR_DATRDY_Pos                   _UINT32_(0)                                          /* (AESB_IMR) Data Ready Interrupt Mask Position */
#define AESB_IMR_DATRDY_Msk                   (_UINT32_(0x1) << AESB_IMR_DATRDY_Pos)               /* (AESB_IMR) Data Ready Interrupt Mask Mask */
#define AESB_IMR_DATRDY(value)                (AESB_IMR_DATRDY_Msk & (_UINT32_(value) << AESB_IMR_DATRDY_Pos)) /* Assigment of value for DATRDY in the AESB_IMR register */
#define AESB_IMR_URAD_Pos                     _UINT32_(8)                                          /* (AESB_IMR) Unspecified Register Access Detection Interrupt Mask Position */
#define AESB_IMR_URAD_Msk                     (_UINT32_(0x1) << AESB_IMR_URAD_Pos)                 /* (AESB_IMR) Unspecified Register Access Detection Interrupt Mask Mask */
#define AESB_IMR_URAD(value)                  (AESB_IMR_URAD_Msk & (_UINT32_(value) << AESB_IMR_URAD_Pos)) /* Assigment of value for URAD in the AESB_IMR register */
#define AESB_IMR_SECE_Pos                     _UINT32_(19)                                         /* (AESB_IMR) Security and/or Safety Event Position */
#define AESB_IMR_SECE_Msk                     (_UINT32_(0x1) << AESB_IMR_SECE_Pos)                 /* (AESB_IMR) Security and/or Safety Event Mask */
#define AESB_IMR_SECE(value)                  (AESB_IMR_SECE_Msk & (_UINT32_(value) << AESB_IMR_SECE_Pos)) /* Assigment of value for SECE in the AESB_IMR register */
#define AESB_IMR_Msk                          _UINT32_(0x00080101)                                 /* (AESB_IMR) Register Mask  */


/* -------- AESB_ISR : (AESB Offset: 0x1C) ( R/ 32) Interrupt Status Register -------- */
#define AESB_ISR_DATRDY_Pos                   _UINT32_(0)                                          /* (AESB_ISR) Data Ready Position */
#define AESB_ISR_DATRDY_Msk                   (_UINT32_(0x1) << AESB_ISR_DATRDY_Pos)               /* (AESB_ISR) Data Ready Mask */
#define AESB_ISR_DATRDY(value)                (AESB_ISR_DATRDY_Msk & (_UINT32_(value) << AESB_ISR_DATRDY_Pos)) /* Assigment of value for DATRDY in the AESB_ISR register */
#define AESB_ISR_URAD_Pos                     _UINT32_(8)                                          /* (AESB_ISR) Unspecified Register Access Detection Status Position */
#define AESB_ISR_URAD_Msk                     (_UINT32_(0x1) << AESB_ISR_URAD_Pos)                 /* (AESB_ISR) Unspecified Register Access Detection Status Mask */
#define AESB_ISR_URAD(value)                  (AESB_ISR_URAD_Msk & (_UINT32_(value) << AESB_ISR_URAD_Pos)) /* Assigment of value for URAD in the AESB_ISR register */
#define AESB_ISR_URAT_Pos                     _UINT32_(12)                                         /* (AESB_ISR) Unspecified Register Access Position */
#define AESB_ISR_URAT_Msk                     (_UINT32_(0xF) << AESB_ISR_URAT_Pos)                 /* (AESB_ISR) Unspecified Register Access Mask */
#define AESB_ISR_URAT(value)                  (AESB_ISR_URAT_Msk & (_UINT32_(value) << AESB_ISR_URAT_Pos)) /* Assigment of value for URAT in the AESB_ISR register */
#define   AESB_ISR_URAT_IDR_WR_PROCESSING_Val _UINT32_(0x0)                                        /* (AESB_ISR) Input Data register written during the data processing when SMOD = 0x2 mode  */
#define   AESB_ISR_URAT_ODR_RD_PROCESSING_Val _UINT32_(0x1)                                        /* (AESB_ISR) Output Data register read during the data processing  */
#define   AESB_ISR_URAT_MR_WR_PROCESSING_Val  _UINT32_(0x2)                                        /* (AESB_ISR) Mode register written during the data processing  */
#define   AESB_ISR_URAT_ODR_RD_SUBKGEN_Val    _UINT32_(0x3)                                        /* (AESB_ISR) Output Data register read during the sub-keys generation  */
#define   AESB_ISR_URAT_MR_WR_SUBKGEN_Val     _UINT32_(0x4)                                        /* (AESB_ISR) Mode register written during the sub-keys generation  */
#define   AESB_ISR_URAT_WOR_RD_ACCESS_Val     _UINT32_(0x5)                                        /* (AESB_ISR) Write-only register read access  */
#define AESB_ISR_URAT_IDR_WR_PROCESSING       (AESB_ISR_URAT_IDR_WR_PROCESSING_Val << AESB_ISR_URAT_Pos) /* (AESB_ISR) Input Data register written during the data processing when SMOD = 0x2 mode Position  */
#define AESB_ISR_URAT_ODR_RD_PROCESSING       (AESB_ISR_URAT_ODR_RD_PROCESSING_Val << AESB_ISR_URAT_Pos) /* (AESB_ISR) Output Data register read during the data processing Position  */
#define AESB_ISR_URAT_MR_WR_PROCESSING        (AESB_ISR_URAT_MR_WR_PROCESSING_Val << AESB_ISR_URAT_Pos) /* (AESB_ISR) Mode register written during the data processing Position  */
#define AESB_ISR_URAT_ODR_RD_SUBKGEN          (AESB_ISR_URAT_ODR_RD_SUBKGEN_Val << AESB_ISR_URAT_Pos) /* (AESB_ISR) Output Data register read during the sub-keys generation Position  */
#define AESB_ISR_URAT_MR_WR_SUBKGEN           (AESB_ISR_URAT_MR_WR_SUBKGEN_Val << AESB_ISR_URAT_Pos) /* (AESB_ISR) Mode register written during the sub-keys generation Position  */
#define AESB_ISR_URAT_WOR_RD_ACCESS           (AESB_ISR_URAT_WOR_RD_ACCESS_Val << AESB_ISR_URAT_Pos) /* (AESB_ISR) Write-only register read access Position  */
#define AESB_ISR_SECE_Pos                     _UINT32_(19)                                         /* (AESB_ISR) Security and/or Safety Event Position */
#define AESB_ISR_SECE_Msk                     (_UINT32_(0x1) << AESB_ISR_SECE_Pos)                 /* (AESB_ISR) Security and/or Safety Event Mask */
#define AESB_ISR_SECE(value)                  (AESB_ISR_SECE_Msk & (_UINT32_(value) << AESB_ISR_SECE_Pos)) /* Assigment of value for SECE in the AESB_ISR register */
#define AESB_ISR_Msk                          _UINT32_(0x0008F101)                                 /* (AESB_ISR) Register Mask  */


/* -------- AESB_KEYWR : (AESB Offset: 0x20) ( /W 32) Key Word Register -------- */
#define AESB_KEYWR_KEYW_Pos                   _UINT32_(0)                                          /* (AESB_KEYWR) Key Word Position */
#define AESB_KEYWR_KEYW_Msk                   (_UINT32_(0xFFFFFFFF) << AESB_KEYWR_KEYW_Pos)        /* (AESB_KEYWR) Key Word Mask */
#define AESB_KEYWR_KEYW(value)                (AESB_KEYWR_KEYW_Msk & (_UINT32_(value) << AESB_KEYWR_KEYW_Pos)) /* Assigment of value for KEYW in the AESB_KEYWR register */
#define AESB_KEYWR_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (AESB_KEYWR) Register Mask  */


/* -------- AESB_IDATAR : (AESB Offset: 0x40) ( /W 32) Input Data Register -------- */
#define AESB_IDATAR_IDATA_Pos                 _UINT32_(0)                                          /* (AESB_IDATAR) Input Data Word Position */
#define AESB_IDATAR_IDATA_Msk                 (_UINT32_(0xFFFFFFFF) << AESB_IDATAR_IDATA_Pos)      /* (AESB_IDATAR) Input Data Word Mask */
#define AESB_IDATAR_IDATA(value)              (AESB_IDATAR_IDATA_Msk & (_UINT32_(value) << AESB_IDATAR_IDATA_Pos)) /* Assigment of value for IDATA in the AESB_IDATAR register */
#define AESB_IDATAR_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (AESB_IDATAR) Register Mask  */


/* -------- AESB_ODATAR : (AESB Offset: 0x50) ( R/ 32) Output Data Register -------- */
#define AESB_ODATAR_ODATA_Pos                 _UINT32_(0)                                          /* (AESB_ODATAR) Output Data Position */
#define AESB_ODATAR_ODATA_Msk                 (_UINT32_(0xFFFFFFFF) << AESB_ODATAR_ODATA_Pos)      /* (AESB_ODATAR) Output Data Mask */
#define AESB_ODATAR_ODATA(value)              (AESB_ODATAR_ODATA_Msk & (_UINT32_(value) << AESB_ODATAR_ODATA_Pos)) /* Assigment of value for ODATA in the AESB_ODATAR register */
#define AESB_ODATAR_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (AESB_ODATAR) Register Mask  */


/* -------- AESB_IVR : (AESB Offset: 0x60) ( /W 32) Initialization Vector Register -------- */
#define AESB_IVR_IV_Pos                       _UINT32_(0)                                          /* (AESB_IVR) Initialization Vector Position */
#define AESB_IVR_IV_Msk                       (_UINT32_(0xFFFFFFFF) << AESB_IVR_IV_Pos)            /* (AESB_IVR) Initialization Vector Mask */
#define AESB_IVR_IV(value)                    (AESB_IVR_IV_Msk & (_UINT32_(value) << AESB_IVR_IV_Pos)) /* Assigment of value for IV in the AESB_IVR register */
#define AESB_IVR_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (AESB_IVR) Register Mask  */


/* -------- AESB_EMR : (AESB Offset: 0xB0) (R/W 32) Extended Mode Register -------- */
#define AESB_EMR_PKWO_Pos                     _UINT32_(6)                                          /* (AESB_EMR) Private Key Write Once Position */
#define AESB_EMR_PKWO_Msk                     (_UINT32_(0x1) << AESB_EMR_PKWO_Pos)                 /* (AESB_EMR) Private Key Write Once Mask */
#define AESB_EMR_PKWO(value)                  (AESB_EMR_PKWO_Msk & (_UINT32_(value) << AESB_EMR_PKWO_Pos)) /* Assigment of value for PKWO in the AESB_EMR register */
#define AESB_EMR_PKRS_Pos                     _UINT32_(7)                                          /* (AESB_EMR) Private Key Internal Register Select Position */
#define AESB_EMR_PKRS_Msk                     (_UINT32_(0x1) << AESB_EMR_PKRS_Pos)                 /* (AESB_EMR) Private Key Internal Register Select Mask */
#define AESB_EMR_PKRS(value)                  (AESB_EMR_PKRS_Msk & (_UINT32_(value) << AESB_EMR_PKRS_Pos)) /* Assigment of value for PKRS in the AESB_EMR register */
#define AESB_EMR_Msk                          _UINT32_(0x000000C0)                                 /* (AESB_EMR) Register Mask  */


/* -------- AESB_WPMR : (AESB Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define AESB_WPMR_WPEN_Pos                    _UINT32_(0)                                          /* (AESB_WPMR) Write Protection Configuration Enable Position */
#define AESB_WPMR_WPEN_Msk                    (_UINT32_(0x1) << AESB_WPMR_WPEN_Pos)                /* (AESB_WPMR) Write Protection Configuration Enable Mask */
#define AESB_WPMR_WPEN(value)                 (AESB_WPMR_WPEN_Msk & (_UINT32_(value) << AESB_WPMR_WPEN_Pos)) /* Assigment of value for WPEN in the AESB_WPMR register */
#define AESB_WPMR_WPITEN_Pos                  _UINT32_(1)                                          /* (AESB_WPMR) Write Protection Interruption Enable Position */
#define AESB_WPMR_WPITEN_Msk                  (_UINT32_(0x1) << AESB_WPMR_WPITEN_Pos)              /* (AESB_WPMR) Write Protection Interruption Enable Mask */
#define AESB_WPMR_WPITEN(value)               (AESB_WPMR_WPITEN_Msk & (_UINT32_(value) << AESB_WPMR_WPITEN_Pos)) /* Assigment of value for WPITEN in the AESB_WPMR register */
#define AESB_WPMR_WPCREN_Pos                  _UINT32_(2)                                          /* (AESB_WPMR) Write Protection Control Enable Position */
#define AESB_WPMR_WPCREN_Msk                  (_UINT32_(0x1) << AESB_WPMR_WPCREN_Pos)              /* (AESB_WPMR) Write Protection Control Enable Mask */
#define AESB_WPMR_WPCREN(value)               (AESB_WPMR_WPCREN_Msk & (_UINT32_(value) << AESB_WPMR_WPCREN_Pos)) /* Assigment of value for WPCREN in the AESB_WPMR register */
#define AESB_WPMR_FIRSTE_Pos                  _UINT32_(4)                                          /* (AESB_WPMR) First Error Report Enable Position */
#define AESB_WPMR_FIRSTE_Msk                  (_UINT32_(0x1) << AESB_WPMR_FIRSTE_Pos)              /* (AESB_WPMR) First Error Report Enable Mask */
#define AESB_WPMR_FIRSTE(value)               (AESB_WPMR_FIRSTE_Msk & (_UINT32_(value) << AESB_WPMR_FIRSTE_Pos)) /* Assigment of value for FIRSTE in the AESB_WPMR register */
#define AESB_WPMR_ACTION_Pos                  _UINT32_(5)                                          /* (AESB_WPMR) Action on Abnormal Event Detection Position */
#define AESB_WPMR_ACTION_Msk                  (_UINT32_(0x7) << AESB_WPMR_ACTION_Pos)              /* (AESB_WPMR) Action on Abnormal Event Detection Mask */
#define AESB_WPMR_ACTION(value)               (AESB_WPMR_ACTION_Msk & (_UINT32_(value) << AESB_WPMR_ACTION_Pos)) /* Assigment of value for ACTION in the AESB_WPMR register */
#define   AESB_WPMR_ACTION_REPORT_ONLY_Val    _UINT32_(0x0)                                        /* (AESB_WPMR) No action (stop or clear key) is performed when one of PKRPVS, WPVS, CGD, SEQE, or SWE flags is set.  */
#define   AESB_WPMR_ACTION_LOCK_PKRPVS_WPVS_SWE_Val _UINT32_(0x1)                                        /* (AESB_WPMR) If a processing is in progress when the AESB_WPSR.PKRPVS/WPVS/SWE event detection occurs, the current processing is ended normally but no other processing is started while a AESB_CR.UNLOCK command is issued.  */
#define   AESB_WPMR_ACTION_LOCK_CGD_SEQE_Val  _UINT32_(0x2)                                        /* (AESB_WPMR) If a processing is in progress when the AESB_WPSR.CGD/SEQE event detection occurs, the current processing is ended normally but no other processing is started while a AESB_CR.UNLOCK command is issued.  */
#define   AESB_WPMR_ACTION_LOCK_ANY_EV_Val    _UINT32_(0x3)                                        /* (AESB_WPMR) If a processing is in progress when the AESB_WPSR.PKRPVS/WPVS/CGD/SEQE/SWE events detection occurs, the current processing is ended normally but no other processing is started while a AESB_CR.UNLOCK command is issued.  */
#define   AESB_WPMR_ACTION_CLEAR_PKRPVS_WPVS_SWE_Val _UINT32_(0x4)                                        /* (AESB_WPMR) If a processing is in progress when the AESB_WPSR.PKRPVS/WPVS/SWE events detection occurs, the current processing is ended normally but no other processing is started while a AESB_CR.UNLOCK command is issued. Moreover, the AESB_KEYWRx key is immediately cleared.  */
#define   AESB_WPMR_ACTION_CLEAR_CGD_SEQE_Val _UINT32_(0x5)                                        /* (AESB_WPMR) If a processing is in progress when the AESB_WPSR.CGD/SEQE events detection occurs, the current processing is ended normally but no other processing is started while a AESB_CR.UNLOCK command is issued. Moreover, the AESB_KEYWRx key is immediately cleared.  */
#define   AESB_WPMR_ACTION_CLEAR_ANY_EV_Val   _UINT32_(0x6)                                        /* (AESB_WPMR) If a processing is in progress when the AESB_WPSR.PKRPVS/WPVS/CGD/SEQE/SWE events detection occurs, the current processing is ended normally but no other processing is started while a AESB_CR.UNLOCK command is issued. Moreover, the AESB_KEYWRx key is immediately cleared.  */
#define AESB_WPMR_ACTION_REPORT_ONLY          (AESB_WPMR_ACTION_REPORT_ONLY_Val << AESB_WPMR_ACTION_Pos) /* (AESB_WPMR) No action (stop or clear key) is performed when one of PKRPVS, WPVS, CGD, SEQE, or SWE flags is set. Position  */
#define AESB_WPMR_ACTION_LOCK_PKRPVS_WPVS_SWE (AESB_WPMR_ACTION_LOCK_PKRPVS_WPVS_SWE_Val << AESB_WPMR_ACTION_Pos) /* (AESB_WPMR) If a processing is in progress when the AESB_WPSR.PKRPVS/WPVS/SWE event detection occurs, the current processing is ended normally but no other processing is started while a AESB_CR.UNLOCK command is issued. Position  */
#define AESB_WPMR_ACTION_LOCK_CGD_SEQE        (AESB_WPMR_ACTION_LOCK_CGD_SEQE_Val << AESB_WPMR_ACTION_Pos) /* (AESB_WPMR) If a processing is in progress when the AESB_WPSR.CGD/SEQE event detection occurs, the current processing is ended normally but no other processing is started while a AESB_CR.UNLOCK command is issued. Position  */
#define AESB_WPMR_ACTION_LOCK_ANY_EV          (AESB_WPMR_ACTION_LOCK_ANY_EV_Val << AESB_WPMR_ACTION_Pos) /* (AESB_WPMR) If a processing is in progress when the AESB_WPSR.PKRPVS/WPVS/CGD/SEQE/SWE events detection occurs, the current processing is ended normally but no other processing is started while a AESB_CR.UNLOCK command is issued. Position  */
#define AESB_WPMR_ACTION_CLEAR_PKRPVS_WPVS_SWE (AESB_WPMR_ACTION_CLEAR_PKRPVS_WPVS_SWE_Val << AESB_WPMR_ACTION_Pos) /* (AESB_WPMR) If a processing is in progress when the AESB_WPSR.PKRPVS/WPVS/SWE events detection occurs, the current processing is ended normally but no other processing is started while a AESB_CR.UNLOCK command is issued. Moreover, the AESB_KEYWRx key is immediately cleared. Position  */
#define AESB_WPMR_ACTION_CLEAR_CGD_SEQE       (AESB_WPMR_ACTION_CLEAR_CGD_SEQE_Val << AESB_WPMR_ACTION_Pos) /* (AESB_WPMR) If a processing is in progress when the AESB_WPSR.CGD/SEQE events detection occurs, the current processing is ended normally but no other processing is started while a AESB_CR.UNLOCK command is issued. Moreover, the AESB_KEYWRx key is immediately cleared. Position  */
#define AESB_WPMR_ACTION_CLEAR_ANY_EV         (AESB_WPMR_ACTION_CLEAR_ANY_EV_Val << AESB_WPMR_ACTION_Pos) /* (AESB_WPMR) If a processing is in progress when the AESB_WPSR.PKRPVS/WPVS/CGD/SEQE/SWE events detection occurs, the current processing is ended normally but no other processing is started while a AESB_CR.UNLOCK command is issued. Moreover, the AESB_KEYWRx key is immediately cleared. Position  */
#define AESB_WPMR_WPKEY_Pos                   _UINT32_(8)                                          /* (AESB_WPMR) Write Protection Key Position */
#define AESB_WPMR_WPKEY_Msk                   (_UINT32_(0xFFFFFF) << AESB_WPMR_WPKEY_Pos)          /* (AESB_WPMR) Write Protection Key Mask */
#define AESB_WPMR_WPKEY(value)                (AESB_WPMR_WPKEY_Msk & (_UINT32_(value) << AESB_WPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the AESB_WPMR register */
#define   AESB_WPMR_WPKEY_PASSWD_Val          _UINT32_(0x414553)                                   /* (AESB_WPMR) Writing any other value in this field aborts the write operation of the WPEN,WPITEN,WPCREN bits. Always reads as 0.  */
#define AESB_WPMR_WPKEY_PASSWD                (AESB_WPMR_WPKEY_PASSWD_Val << AESB_WPMR_WPKEY_Pos)  /* (AESB_WPMR) Writing any other value in this field aborts the write operation of the WPEN,WPITEN,WPCREN bits. Always reads as 0. Position  */
#define AESB_WPMR_Msk                         _UINT32_(0xFFFFFFF7)                                 /* (AESB_WPMR) Register Mask  */


